
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ Бормотов А.Ю. Добавление дополнительных реквизитов и элементов на форму
	КЛ_Служебный.ПриСозданииНаСервереФормаДокументаЗаказПокупателя(ЭтотОбъект);	
	//--
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//++ Бормотов
	Если НЕ ПроверитьКорректностьСкидки() Тогда
		ТекущиеДанные.Скидка = 0;
		СообщениеПользователю()
	КонецЕсли;
	//-- Бормотов
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	//++ Бормотов А.Ю.
	Если НЕ ПроверитьКорректностьСкидки() Тогда
		ТекущиеДанные.Скидка = 0;
		СообщениеПользователю()
	КонецЕсли;
	//--
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПересчитатьТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеПользователю()
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Совокупная скидка не может быть больше 100%";
		Сообщение.Сообщить();
	КонецПроцедуры

&НаКлиенте
Процедура СпроситьОПересчетеТаблиц()
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтотОбъект);
	ТекстВопроса = "Размер скидки изменен. Пересчитать данные таблицы?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьСкидки()
	
	ОбщаяСкидка = Объект.КЛ_СогласованнаяСкидка;
	
	Для Каждого Строка Из Объект.Товары Цикл
		Если Строка.Скидка + ОбщаяСкидка > 100 Тогда
			Возврат Ложь
		КонецЕсли
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл
		Если Строка.Скидка + ОбщаяСкидка > 100 Тогда
			Возврат Ложь
		КонецЕсли
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//++ Бормотов А.Ю.
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена * (1 - ((Объект.КЛ_СогласованнаяСкидка + ТекущиеДанные.Скидка) / 100));
	РассчитатьСуммуДокумента();
	//-- Бормотов А.Ю.
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура КЛ_СогласованнаяСкидкаПриИзменении(Элемент) Экспорт
	
	//++Бормотов
	СкидкаКорректна = ПроверитьКорректностьСкидки();
	
	Если СкидкаКорректна Тогда
		Если Объект.Товары.Количество() > 0 ИЛИ Объект.Услуги.Количество() > 0 Тогда
			СпроситьОПересчетеТаблиц();
		КонецЕсли;
	Иначе
		Объект.КЛ_СогласованнаяСкидка = 0;
		СообщениеПользователю()
	КонецЕсли;
	//--Бормотов
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицы()
	
	Товары = Объект.Товары;
	Услуги = Объект.Услуги;
	
	Для Каждого Строка Из Товары Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;
	
	Для Каждого Строка Из Услуги Цикл
		РассчитатьСуммуСтроки(Строка)
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПересчитатьСумму(Команда)
	ПересчитатьТаблицы();
КонецПроцедуры
#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
