#Область СлужебныеПроцедурыИФункции
	Процедура ПриСозданииНаСервереФормаДокументаЗаказПокупателя(Объект) Экспорт
		
		Форма = Объект.Этаформа;
		Элементы = Форма.Элементы;
		
// Добавление реквизита "КЛ_СогласованнаяСкидка" на форму		
		ТипРеквизита = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5,2));
		РеквизитФормы = Новый РеквизитФормы("КЛ_СогласованнаяСкидка", ТипРеквизита,,,Истина);
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
// Добавление элемента "КЛ_СогласованнаяСкидка" на форму
		ЭлементСогласованнаяСкидка = Элементы.Вставить("КЛ_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
		ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.КЛ_СогласованнаяСкидка";
		ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСогласованнаяСкидка.Заголовок = "Согласованная скидка";
		ЭлементСогласованнаяСкидка.МаксимальноеЗначение = 0;
		ЭлементСогласованнаяСкидка.МаксимальноеЗначение = 100;
		
КонецПроцедуры 
#КонецОбласти